[{"title": "Elu Mus (Mutton Curry)", "ingredients": "900 g Mutton|50 ml Vinegar|1 Onion|3 Cloves garlic|4 sl Ginger|50 ml Oil|1/2 ts Chilli powder|2 ts Paprika|1/2 ts Turmeric|1/4 ts Black pepper|3 ts Coriander|1 ts Cumin|1/4 ts Fenugreek sprig curry leaves|500 ml Coconut milk|1/4 ts Curry powder|1 ts Salt", "instructions": "Cut the mutton into bite size pieces and place in a bowl. Pour on the vinegar and leave to marinade for 30 minutes. Chop the onion, then grind in a pestle and mortar with the garlic and ginger. Heat the oil and fry the onion, garlic and ginger. Add the chilli powder, paprika powder, turmeric, black pepper, coriander powder, cumin powder, fenugreek and curry leaves and stir fry for 3 minutes. Drain and remove the mutton from the marinade and add to the pan. Fry for 5 minutes, then pour in the coconut milk together with the marinade and bring to the boil. Cover the pan, reduce the heat and simmer for I hour, or until mutton is cooked. Just prior to serving sprinkle with the curry powder and add salt to taste. From \"A taste of Sri Lanka\" by Indra Jayasekera, ISBN #962 224 010 0"}, {"title": "Elegant Seafood Casserole", "ingredients": "1 1/2 lb Scrod fillet* (about 1 inch thick), cut into 4 pieces|1 tb Lemon juice|1/2 ts Dried tarragon leaves|4 sl Tomato|1/2 c Dry white wine, clam juice or chicken broth|1/2 c Half and half|5 1/2 tb Cornstarch|1 cn (about 6 ounces) cooked peeled shrimp, drained|4 Servings Idaho instant mashed potato flakes**", "instructions": "In microwave-safe 9-inch deep dish, pie plate or shallow casserole. arrange scrod in single layer. Sprinkle with lemon juice, salt, pepper and tarragon. Top each with tomato, onion and mushrooms; add wine. Cover loosely with plastic wrap; cook on High 11 to 13 minutes or until fish flakes easily with fork, rotating dish once. Meanwhile, in microwave-safe 4-cup measure, combine half and half and cornstarch until smooth; stir in shrimp. Drain liquid from scrod into measure. Cook on High 3 to 4 minutes or unti l thickened, stirring once. Pour sauce over scrod. Spread or decoratively pipe potatoes over sauce. Sprinkle with paprika. Cook on High 2 minutes to heat through. Makes 4 servings * Or substitute for any white fleshed fish filet ** Mashed Potatoes: In microwave-safe bowl combine 1 1/4 cups hot water, 1/2 cup milk, 2 tablespoons margarine or butter and 1/2 teaspoon salt. Stir in 1 1/3 cups mashed potato flakes Cover loosely with plastic wrap; cook on High 2 to 3 minutes or until bubbly. Stir before using."}]